testsuite_results/sysbench/results/oltp_update_index.lua_threads64/run.perf.log
sysbench 1.1.0 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 64
Warmup time: 10s
Report intermediate results every 20 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

Warming up for 10 seconds...

[ 20s ] thds: 64 tps: 3799.00 qps: 3799.00 (r/w/o: 0.00/3799.00/0.00) lat (ms,95%): 19.29 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 64 tps: 3988.35 qps: 3988.35 (r/w/o: 0.00/3988.35/0.00) lat (ms,95%): 21.11 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 64 tps: 3978.30 qps: 3978.30 (r/w/o: 0.00/3978.30/0.00) lat (ms,95%): 21.11 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           237653
        other:                           0
        total:                           237653
    transactions:                        237653 (3960.10 per sec.)
    queries:                             237653 (3960.10 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      3960.1037
    time elapsed:                        60.0120s
    total number of events:              237653

Latency (ms):
         min:                                    5.42
         avg:                                   16.16
         max:                                   68.87
         95th percentile:                       20.74
         sum:                              3840308.26

Threads fairness:
    events (avg/stddev):           3712.7656/14.66
    execution time (avg/stddev):   60.0048/0.00

sysbench 1.1.0 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 64
Warmup time: 10s
Report intermediate results every 20 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

Warming up for 10 seconds...

[ 20s ] thds: 64 tps: 4039.04 qps: 4039.04 (r/w/o: 0.00/4039.04/0.00) lat (ms,95%): 20.00 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 64 tps: 4046.20 qps: 4046.20 (r/w/o: 0.00/4046.20/0.00) lat (ms,95%): 20.00 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 64 tps: 3916.55 qps: 3916.55 (r/w/o: 0.00/3916.55/0.00) lat (ms,95%): 20.74 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           240083
        other:                           0
        total:                           240083
    transactions:                        240083 (4000.31 per sec.)
    queries:                             240083 (4000.31 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      4000.3124
    time elapsed:                        60.0162s
    total number of events:              240083

Latency (ms):
         min:                                    3.88
         avg:                                   16.00
         max:                                  150.78
         95th percentile:                       20.00
         sum:                              3840885.50

Threads fairness:
    events (avg/stddev):           3751.2969/41.49
    execution time (avg/stddev):   60.0138/0.00